Project_Files/02_OpenFOAM_NX-2/AoA_9/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    INLET
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
    OUTLET
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
    WING
    {
        type            fixedValue;
        value           uniform 0;
    }
    BOTTOM
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
	TOP
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
	SIDE
    {
        type            symmetry;
    }
	SIDE_S
    {
        type            symmetry;
    }
}

// ************************************************************************* //
