Project_Files/02_OpenFOAM_NX-2/AoA_9/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-10  0 -4)
    ( 20  0 -4)
    ( 20  4 -4)
    (-10  4 -4)
    (-10  0  4)
    ( 20  0  4)
    ( 20  4  4)
    (-10  4  4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 20 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    SIDE_S
    {
        type symmetry;
        faces
        (
            (1 5 4 0)
        );
    }
    
    SIDE
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }

    INLET
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    OUTLET
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    TOP
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    BOTTOM
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
